%% 本程序的作用，
%    绘制出2015-2019年服务业有增量的产业的增量权重占比


%% 原始数据
clear;clc;
M= [491 461 435 399 368 330 314 298 277;
    26086 24095 22077 20700 19371 16342 13802 12542 11087;
    227611.3	189334.7	169325.9	152424.5	130480.7	107321.8	91724.2	79657.9	56683.6;
    
    746 783 727 540 504 472 414 373 341;
    17472 17925 18489 19059 16638 14174 11708 9924 8639;
    90308.7	83617.7	76250.6	70610.3	64844.3	59964	56299.8	46853.4	41293.4;
    
    567 528 536 402 378 341 322 287 260;
    49863 44343 38930 33542 34739 33003 29836 28525 25659;
    440823.2	391980.6	408017.2	377783.1	347326.7	315806.2	286587.8	259487.3	232252.6;
    
    256 275 332 148 129 116 108 102 92;
    5240 5212 5145 5544 5583 4986 4362 3623 2739;
    87500000	87041177	87235021	77382499	69575734	62768292	58097239	54271581	49262087;
    
    308 295 309 294 282 276 276 278 284;
    75904 67280 62025 56433 55329 52885 50139 50284 48071;
    29190.7	22286.3	57250.92	51278.29	45660.77	39389.82	34195.1	30311.86	26276.1;
    
    6960 6485 6318 6212 5779 5057 4238 3722 2946;
    124 122 138 80 73 63 57 52 43;
    96936.8	75512.5	83550.4	79254.8	67154.5	53562.7	46012.1	39827.7	35252.9;
    
    19747 19944 20311 20480 20616 20933 21254 21467 21055;
    2326911 2102993 1945035 1848495 1813885 1775413 1724585 1712748 1616908;
    ];

data=zeros(9,7);  % 储存计算后的熵权

[row,col]=size (M);                 % 14,9
for exceptcol = 1:9
    X=M(: , exceptcol:col );          % 除去指定的年份
    
    X=X.';
    % 归一化处理
    [m, n] = size(X);
    Xn = zeros(m, n);
    for j = 1:n
        Xn(:,j) = X(:,j) ./ sum(X(:,j));
    end
    
    %% 计算每个指标的熵值
    E = -sum(Xn .* log(Xn), 1);
    % 计算每个指标的权重
    w = (1 - E) ./ sum(1 - E);
    
    %% 输出结果
    disp("exceptcol:"+exceptcol)
    Q=[
        w(:,1) + w(:,2) + w(:,3)
        w(:,4) + w(:,5) + w(:,6)
        w(:,7) + w(:,8) + w(:,9)
        w(:,10) + w(:,11) + w(:,12)
        w(:,13) + w(:,14) + w(:,15)
        w(:,16) + w(:,17) + w(:,18)
        w(:,19) + w(:,20)
        ];
    data(exceptcol,:)=Q;
end
disp(data);


%% 计算2015_2019权重增幅占比
zengfu2013_215=[];
for i=1:7
    zengfu2015_2019(i)= data(3 ,i )- data(7,i);
end
% disp(zengfu2015_2019);         % 输出增幅
sumvalue=0;                                  % 增幅的总和
for i=1:7
    sumvalue=sumvalue+abs(zengfu2015_2019(i)  );
end
disp(sumvalue);
zengfubilv  =  zengfu2015_2019  /  sumvalue;
disp(zengfubilv);          % 输出增幅的权重占比
%% 将增幅的比率正向化并且作图
ledenddata=["数字化产业","金融产业","商业","教培行业","文化餐饮旅游","医疗社会保障","其它服务业"];
count=0;
for i=1:7
    if zengfubilv(i)>0
        count=count+1;
        newdata(count)=zengfubilv(i);
        currentlegend(count) = ledenddata(i);
    end
end
sumvalue= sum(newdata) ;
newdata=newdata / sumvalue;
disp(newdata)
v=zeros(size(newdata));
v(1)=1;                 % 让数字化产业从饼形图中分离出来
pie(newdata,v);
legend(currentlegend);
title("2015-2019年对服务业增长量的贡献率占比")

